package com.blackwell.arraysorts;

/**
 * Еще одна модификация сортировки пузырьком. Для того, чтобы избавиться от «черепах»,
 * будем переставлять элементы, стоящие на расстоянии. Зафиксируем его и будем идти слева
 * направо, сравнивая элементы, стоящие на этом расстоянии, переставляя их, если необходимо.
 * Очевидно, это позволит «черепахам» быстро добраться в начало массива. Оптимально изначально
 * взять расстояние равным длине массива, а далее делить его на некоторый коэффициент, равный
 * примерно 1.247. Когда расстояние станет равно единице, выполняется сортировка пузырьком.
 * В лучшем случае асимптотика равна O(nlogn), в худшем – O(n2). Какая асимптотика в среднем
 * мне не очень понятно, на практике похоже на O(nlogn).
 */
public class CombSort {

}
